Repository: AChep/keyguard-app
Catalog: appleUi/Sources/KeyguardUI/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hu, it, ja, ko, pt_br, pt_pt, ru, uk, zh_hans

# folderpicker_create_new_folder
source: Create a new folder:
ar: إنشاء مجلد جديد:
de: Neuen Ordner erstellen:
es: Crear una nueva carpeta:
fr: Créer un nouveau dossier :
hu: Hozzon létre egy új mappát:
it: Crea una nuova cartella:
ja: 新しいフォルダの作成:
ko: 새 폴더 만들기:
pt_br: Criar uma nova pasta:
pt_pt: Criar uma nova pasta:
ru: Создать новую папку:
uk: Створити нову теку:
zh_hans: 创建新文件夹

# folderpicker_header_title
source: Choose a folder
ar: اختر مجلدًا
de: Ordner auswählen
es: Elige una carpeta
fr: Choisir un dossier
hu: Válasszon egy mappát
it: Scegli una cartella
ja: フォルダーの選択
ko: 폴더 선택
pt_br: Escolha uma pasta
pt_pt: Escolher uma pasta
ru: Выбрать папку
uk: Вибрати теку
zh_hans: 选择文件夹

source: Folders
ar: المجلدات
de: Ordner
es: Carpetas
fr: Dossiers
hu: Mappák
it: Cartelle
ja: フォルダー
ko: 폴더
pt_br: Pastas
pt_pt: Pastas
ru: Папки
uk: Теки
zh_hans: 文件夹

# folders_empty_label
source: No folders
ar: لا توجد مجلدات
de: Keine Ordner vorhanden
es: Sin carpetas
fr: Aucun dossier
hu: Nincsenek mappák
it: Nessuna cartella
ja: フォルダーなし
ko: 폴더 없음
pt_br: Nenhuma pasta
pt_pt: Sem pastas
ru: Нет папок
uk: Теки відсутні
zh_hans: 无文件夹

source: Follow system settings
ar: اتبع إعدادات النظام
de: Systemeinstellungen folgen
es: Seguir ajustes del sistema
fr: Suivre les paramètres système
hu: Rendszerbeállítások követése
it: Segui le impostazioni di sistema
ja: システム設定に従う
ko: 시스템 설정에 따름
pt_br: Usar as configurações do sistema
pt_pt: Seguir definições do sistema
ru: Как в системе
uk: Як у системі
zh_hans: 跟随系统设置

# font_atkinson_hyperlegible_text
source: Developed specifically to increase legibility for readers with low vision, and to improve comprehension
ar: تم تطويره خصيصًا لزيادة الوضوح للقراء ضعاف البصر ولتحسين الفهم
de: Entwickelt zur Verbesserung der Lesbarkeit für Leser mit geringer Sehkraft und zur Verbesserung des Verständnisses
es: Desarrollado específicamente para aumentar la legibilidad para lectores con baja visión, y para mejorar la comprensión
fr: Développé spécifiquement pour augmenter la lisibilité des lecteurs à faible vision et pour améliorer la compréhension
hu: Kifejezetten az olvasási nehézségekkel küzdő emberek számára fejlesztették ki az olvashatóság növelése és a szövegértés javítása érdekében
it: Sviluppato appositamente per aumentare la leggibilità per i lettori con scarsa visione e per migliorare la comprensione
ja: 視覚障害者の可読性を高め、理解を向上させるために、特別に開発されました。
ko: 저시력자의 가독성을 높이고 이해를 돕기 위해 개발되었습니다.
pt_br: Desenvolvido especificamente para facilitar a legibilidade para os leitores com baixa visão e melhorar a compreensão
pt_pt: Desenvolvido especificamente para aumentar a legibilidade para os leitores com baixa visão e para melhorar a compreensão
ru: Разработан специально для повышения разборчивости и улучшения понимания для читателей со слабым зрением
uk: Розроблено спеціально для читачів з низьким рівнем зору
zh_hans: 专为弱视群体开发，以提高易读性和理解力

# found_otp_code
source: Found a one-time password
ar: تم العثور على كلمة مرور لمرة واحدة
de: Einmal Passwort gefunden
es: Encontrada una contraseña de un solo uso
fr: Mot de passe unique trouvé
hu: Egyszeri jelszó (OTP) találva
ko: OTP를 찾았습니다.
pt_br: Encontrou uma senha de uso único
pt_pt: Encontrada palavra-passe de utilização única
ru: Найден одноразовый пароль
uk: Знайдено одноразовий пароль
zh_hans: 已找到一次性密码

# found_value
source: Found a value
ar: تم العثور على قيمة
de: Wert gefunden
es: Encontrado un valor
fr: Valeur trouvée
hu: Érték találva
it: Valore trovato
ko: 값을 찾았습니다.
pt_br: Encontrou um valor
pt_pt: Encontrado um valor
ru: Значение найдено
uk: Знайдено значення
zh_hans: 已找到值

# generator_create_item_with_gpg_key_title
source: Create new GPG Key item
ar: إنشاء عنصر مفتاح GPG جديد
de: Neues GPG-Schlüsselelement erstellen
es: Crear nuevo elemento clave GPG
fr: Créer une nouvelle clé GPG
it: Crea un nuovo elemento Chiave GPG
ja: 新規 GPG キーアイテムを作成
ko: 새 GPG 키 항목 만들기
pt_br: Criar um novo item de chave GPG
pt_pt: Criar novo item de chave GPG
ru: Создать новый GPG-ключ
uk: Створити новий запис з GPG-ключем
zh_hans: 创建新的 GPG 密钥条目

# generator_create_item_with_password_title
source: Create new login with the password
ar: إنشاء تسجيل دخول جديد بكلمة المرور
de: Neuen Login mit Passwort erstellen
es: Crear nueva cuenta con esta contraseña
fr: Créer un nouvel identifiant avec ce mot de passe
hu: Új bejelentkezés létrehozása a jelszóval
it: Crea un nuovo login con la password
ja: このパスワードで新しいログインを作成
ko: 생성한 비밀번호로 새 로그인 만들기
pt_br: Criar novo login com a senha
pt_pt: Criar novo acesso com palavra-passe
ru: Использовать в качестве пароля
uk: Створити новий логін з паролем
zh_hans: 使用此密码新建项目

# generator_create_item_with_ssh_key_title
source: Create new SSH Key item
ar: إنشاء عنصر مفتاح SSH جديد
de: Neues SSH-Schlüsselelement erstellen
es: Crear nuevo elemento clave SSH
fr: Créer une nouvelle clé SSH
hu: Új SSH kulcs elem létrehozása
it: Crea un nuovo elemento Chiave SSH
ja: 新規 SSH キーアイテムを作成
ko: 새 SSH 키 항목 만들기
pt_br: Criar novo item da chave SSH
pt_pt: Criar novo item da chave SSH
ru: Создать новый SSH ключ
uk: Створити новий запис з SSH-ключем
zh_hans: 创建新的 SSH 密钥项

# generator_create_item_with_username_title
source: Create new login with the username
ar: إنشاء تسجيل دخول جديد باسم المستخدم
de: Neuen Login mit dem Benutzernamen erstellen
es: Crear nueva cuenta con este nombre
fr: Créer un nouvel identifiant avec ce nom d'utilisateur
hu: Új bejelentkezés létrehozása a felhasználónévvel
it: Crea un nuovo login con il nome utente
ja: このユーザー名で新しいログインを作成
ko: 생성한 사용자 이름으로 새 로그인 만들기
pt_br: Criar novo login com o nome de usuário
pt_pt: Criar novo acesso com nome de utilizador
ru: Использовать в качестве логина
uk: Створити новий логін з іменем користувача
zh_hans: 使用此用户名新建项目

# generator_email_catch_all_domain_title
source: Domain
ar: اِختِصاص
de: Domäne
es: Dominio
fr: Domaine
hu: Domain név
it: Dominio
ja: ドメイン
ko: 도메인
pt_br: Domínio
pt_pt: Domínio
ru: Домен
uk: Домен
zh_hans: 域名

# generator_email_catch_all_note
source: A catch-all email address provides users the option to receive all mail sent to their domain, even if they are sent to an email address that has not been set up for their domain. Ensure that your email hosting supports this feature before using it.
ar: يوفر عنوان البريد الإلكتروني لاستقبال الرسائل الخاطئة للمستخدمين خيار تلقي كل رسائل البريد المرسلة إلى نطاقهم، حتى إذا تم إرسالها إلى عنوان بريد إلكتروني لم يتم إعداده لنطاقهم. تأكد من أن استضافة البريد الإلكتروني لديك تدعم هذه الميزة قبل استخدامها.
de: Eine "Catch-All-E-Mail-Adresse" bietet Benutzern die Möglichkeit, alle E-Mails an ihre Domain zu erhalten, auch wenn sie an eine E-Mail-Adresse gesendet werden, die nicht für ihre Domain eingerichtet wurde. Stellen Sie sicher, dass Ihr E-Mail-Hosting diese Funktion unterstützt, bevor Sie sie verwenden.
es: Una dirección de correo catch-all proporciona a los usuarios la opción de recibir todo el correo enviado a su dominio, incluso si se envían a una dirección de correo electrónico que no ha sido configurada para su dominio. Asegúrate de que tu alojamiento de correo electrónico soporta esta característica antes de usarla.
fr: Une adresse mail catch-all donne aux utilisateurs la possibilité de recevoir tous les messages envoyés à leur domaine, même si elles sont envoyées à une adresse e-mail qui n'a pas été configurée pour leur domaine. Assurez-vous que votre hébergement de courriel prend en charge cette fonctionnalité avant de l'utiliser.
hu: A gyűjtő e-mail cím lehetővé teszi a felhasználók számára, hogy minden, a domainjükre küldött e-mailt megkapjanak, még akkor is, ha azokat olyan e-mail címre küldték, amelyet nem állítottak be a domainjükhöz. Mielőtt használná, győződjön meg róla, hogy az e-mail tárhelyszolgáltatója támogatja ezt a funkciót.
it: Un indirizzo email catch-all offre agli utenti la possibilità di ricevere tutte le email inviate al proprio dominio, anche se inviate a un indirizzo e-mail che non è stato configurato per il proprio dominio. Prima dell'utilizzo assicurati che il tuo servizio di hosting email supporti questa funzione.
ja: キャッチオールメールアドレスは、ドメインに送信されたすべてのメールを受信できるメールアドレスです。使用する前に、メールホスティングがこの機能をサポートしていることを確認してください。
ko: Catch-all 이메일 주소를 사용하면 이메일 설정에 관계없이 도메인으로 오는 모든 이메일을 받을 수 있습니다. 사용하기 전에 이메일 호스팅 제공 업체에서 이 기능을 지원하는지 확인해 보세요.
pt_br: Um endereço de e-mail catch-all oferece aos usuários a opção de receber todos os e-mails enviados para seu domínio, mesmo se eles forem enviados para um endereço de e-mail que não tenha sido configurado para seu domínio. Certifique-se de que sua hospedagem de e-mail suporta este recurso antes de usá-lo.
pt_pt: Um endereço de e-mail catch-all oferece aos utilizadores a opção de receber todos os e-mails enviados para o seu domínio, mesmo se eles forem enviados para um endereço de e-mail que não tenha sido configurado para o seu domínio. Certifique-se de que o provedor de e-mail suporta este recurso antes de usá-lo.
ru: Универсальный адрес электронной почты предоставляет пользователям возможность получать всю почту, отправляемую на их домен, даже если она отправляется на адрес электронной почты, который не был настроен для их домена. Убедитесь, что ваш почтовый хостинг поддерживает эту функцию, прежде чем использовать её.
uk: Адреса електронної пошти catch-all надає користувачам можливість отримувати повідомлення, надіслані на їхній домен, навіть якщо вони надсилаються на адресу електронної пошти, яка не була налаштована для їх домену. Перед використанням переконайтеся, що ваш хостинг електронної пошти підтримує цю функцію.
zh_hans: Catch-all 电子邮件地址可让用户选择接收发送到其域名的所有邮件，即使这些邮件是发送到未为其域名设置的电子邮件地址。使用前请确保您的电子邮件主机支持此功能。

# generator_email_catch_all_type
source: Catch-all email
ar: البريد الإلكتروني الشامل
de: Catch-All E-Mail Adresse
es: Correo catch-all
fr: Adresse mail attrape-tout (catch-all)
hu: Gyűjtő e-mail
it: Email catch-all
ja: Catch-All メールアドレス
ko: Catch-all 이메일
pt_br: E-mail catch-all
pt_pt: E-mail catch-all
ru: Универсальный e-mail
uk: Адреса ел. пошти catch-all
zh_hans: Catch-all 电子邮件

# generator_email_forward_alias_type
source: Forwarded email alias
ar: الاسم المستعار للبريد الإلكتروني المُعاد توجيهه
de: Weitergeleiteter E-Mail-Alias
es: Alias de correo reenviado
fr: Alias d'adresse mail transféré
hu: Továbbított email álnevek
it: Alias email inoltrate
ja: 転送メールアドレス
ko: 포워딩된 이메일 별칭
pt_br: Alias de e-mail reencaminhado
pt_pt: Alias de e-mail reencaminhado
ru: Псевдоним электронной почты для пересылки
uk: Псевдонім е-пошти для пересилання
zh_hans: 转发的电子邮件别名

# generator_email_plus_addressing_email_title
source: Email
ar: بريد إلكتروني
es: Correo electrónico
fr: Adresse mail
hu: Email cím
ja: メールアドレス
ko: 이메일
uk: Ел. пошта
zh_hans: 电子邮件

# generator_email_plus_addressing_type
source: Plus addressing email
ar: بالإضافة إلى معالجة البريد الإلكتروني
de: Plus-adressierte E-Mail-Adresse
es: Correo electrónico extra
fr: Courriel sous-adressé
hu: Plusz címzéses email
it: Indirizzamento e-mail con segno più (+)
ja: プラスメールアドレス
ko: 플러스 주소 이메일
pt_br: Endereço de e-mail Plus
pt_pt: Endereço de e-mail Plus
ru: Адрес эл. почты с плюсом
uk: Адреса ел. пошти з плюсом
zh_hans: 附加地址电子邮件

# generator_email_subdomain_addressing_email_title
source: Email
ar: بريد إلكتروني
es: Correo electrónico
fr: Adresse mail
hu: Email cím
ja: メールアドレス
ko: 이메일
uk: Ел. пошта
zh_hans: 电子邮件

# generator_email_subdomain_addressing_type
source: Subdomain addressing email
ar: عنوان البريد الإلكتروني للنطاق الفرعي
de: Subdomänen adressierende E-Mail
es: Subdominio del correo electrónico
fr: Adresse mail du sous-domaine
hu: Aldomain-címzéses email
it: Indirizzamento e-mail con sottodominio
ja: サブドメインメールアドレス
ko: 서브도메인 주소 이메일
pt_br: Subdomínio de endereço de e-mail
pt_pt: Subdomínio de endereço de e-mail
ru: Адрес эл.почты для поддомена
uk: Адреса ел. пошти з піддоменом
zh_hans: 子域电子邮件

# generator_generate_button
source: Generate
ar: يولد
de: Generieren
es: Generar
fr: Générer
hu: Generálás
it: Genera
ja: 生成
ko: 생성
pt_br: Gerar
pt_pt: Gerar
ru: Сгенерировать
uk: Згенерувати
zh_hans: 生成

# generator_gpg_key_email_title
source: Email
ar: البريد الإلكتروني
es: Correo electrónico
ja: メールアドレス
ko: 이메일
uk: Електронна пошта
zh_hans: 电子邮件

# generator_gpg_key_modern_note
source: Creates an OpenPGP key with Ed25519 signing/certification keys and an X25519 encryption subkey.
ar: ينشئ مفتاح OpenPGP بمفاتيح توقيع/اعتماد Ed25519 ومفتاح فرعي للتشفير X25519.
de: Erstellt einen OpenPGP-Schlüssel mit Ed25519-Signier-/Zertifizierungsschlüsseln und einem X25519-Verschlüsselungsunterschlüssel.
es: Crea una clave OpenPGP con claves de firma/certificación Ed25519 y una subclave de cifrado X25519.
fr: Crée une clé OpenPGP avec des clés de signature/certification Ed25519 et une sous-clé de chiffrement X25519.
it: Crea una chiave OpenPGP con chiavi di firma/certificazione Ed25519 e una sottochiave di crittografia X25519.
ja: Ed25519 の署名・証明キーと X25519 の暗号化サブキーを持つ OpenPGP キーを作成します。
ko: Ed25519 서명/인증 키와 X25519 암호화 하위 키로 OpenPGP 키를 생성합니다.
pt_br: Cria uma chave OpenPGP com chaves de assinatura/certificação Ed25519 e uma subchave de criptografia X25519.
pt_pt: Cria uma chave OpenPGP com chaves de assinatura/certificação Ed25519 e uma subchave de encriptação X25519.
ru: Создаёт ключ OpenPGP с ключами подписи/сертификации Ed25519 и подключом шифрования X25519.
uk: Створює OpenPGP-ключ із ключами підпису/сертифікації Ed25519 та підключем шифрування X25519.
zh_hans: 创建一个带有 Ed25519 签名/认证主密钥和 X25519 加密子钥的 OpenPGP 密钥。

# generator_gpg_key_modern_text
source: Modern OpenPGP key shape
ar: بنية مفتاح OpenPGP الحديثة
de: Modernes OpenPGP-Schlüsselschema
es: Formato de clave OpenPGP moderno
fr: Format de clé OpenPGP moderne
it: Struttura moderna della chiave OpenPGP
ja: 最新の OpenPGP キー構成
ko: 현대적인 OpenPGP 키 구성
pt_br: Formato de chave OpenPGP moderno
pt_pt: Formato de chave OpenPGP moderno
ru: Современная структура ключа OpenPGP
uk: Сучасна форма OpenPGP-ключа
zh_hans: 现代 OpenPGP 密钥配置

# generator_gpg_key_name_title
source: Name
ar: الاسم
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
pt_pt: Nome
ru: Имя
uk: Ім'я
zh_hans: 名称

# generator_gpg_key_rsa_note
source: Creates an OpenPGP key with an RSA certification key and separate RSA signing and encryption subkeys.
ar: ينشئ مفتاح OpenPGP بمفتاح اعتماد RSA ومفاتيح فرعية منفصلة للتوقيع والتشفير بخوارزمية RSA.
fr: Créer une clé OpenPGP avec une clé de certification RSA et des sous-clés RSA distinctes pour la signature et le chiffrement.
pt_br: Cria uma chave OpenPGP com uma chave de certificação RSA e subchaves separadas de assinatura e criptografia RSA.
pt_pt: Cria uma chave OpenPGP com uma chave de certificação RSA e subchaves RSA separadas para assinatura e encriptação.

# generator_header_gpg_key_title
source: GPG Key generator
ar: مولّد مفاتيح GPG
de: GPG-Schlüsselgenerator
es: Generador de claves GPG
fr: Générateur de clés GPG
it: Generatore chiave GPG
ja: GPG キーの生成
ko: GPG 키 생성기
pt_br: Gerador de chaves GPG
pt_pt: Gerador de chaves GPG
ru: Генератор GPG-ключей
uk: Генератор GPG-ключа
zh_hans: SSH 密钥生成器

# generator_header_password_title
source: Password generator
ar: مولد كلمة المرور
de: Passwortgenerator
es: Generador de contraseñas
fr: Générateur de mots de passe
hu: Jelszó generátor
it: Generatore password
ja: パスワード生成
ko: 비밀번호 생성기
pt_br: Gerador de senha
pt_pt: Gerador de palavra-passe
ru: Генератор паролей
uk: Генератор паролів
zh_hans: 密码生成器

# generator_header_ssh_key_title
source: SSH Key generator
ar: مولد مفتاح SSH
de: SSH-Schlüsselgenerator
es: Generador de claves SSH
fr: Générateur de clés SSH
hu: SSH Kulcs generátor
it: Generatore chiave SSH
ja: SSH キーの生成
ko: SSH 키 생성기
pt_br: Gerador de chave SSH
pt_pt: Gerador de chave SSH
ru: Генератор SSH ключей
uk: Генератор SSH-ключа
zh_hans: SSH 密钥生成器

# generator_header_title
source: Generator
ar: مولد
es: Generador
fr: Générateur
hu: Generátor
it: Generatore
ja: パスワード生成
ko: 생성기
pt_br: Gerador
pt_pt: Gerador automático
ru: Генератор
uk: Генератор
zh_hans: 生成器

# generator_header_username_title
source: Username generator
ar: مولد اسم المستخدم
de: Benutzernamengenerator
es: Generador de nombre de usuario
fr: Générateur de nom d'utilisateur
hu: Felhasználónév generátor
it: Generatore nome utente
ja: ユーザー名生成
ko: 사용자 이름 생성기
pt_br: Gerador de nome de usuário
pt_pt: Gerador de nome de utilizador
ru: Генератор имени пользователя
uk: Генератор імені користувача
zh_hans: 用户名生成器

# generator_key_ed25519_note
source: This is the fastest and most modern standard. Support in SSH clients is not yet universal.
ar: هذا هو أسرع المعايير وأكثرها حداثة. الدعم لعملاء SSH ليس عالمياً بعد.
de: Dies ist der schnellste und modernste Standard. Der Support in SSH-Clients ist noch nicht universell.
es: Este es el estándar más rápido y moderno, el soporte en los clientes SSH no es universal.
fr: C'est la norme la plus rapide et la plus moderne. Le support dans les clients SSH n'est pas encore universel.
hu: Ez a leggyorsabb és legmodernebb szabvány. Az SSH kliensek támogatottsága még nem univerzális.
ja: これは高速かつ最も現代的でスタンダードです。SSH クライアントでのサポートはまだ普及していません。
ko: 가장 빠르고 현대적인 표준입니다. 일부 SSH 클라이언트는 지원하지 않을 수 있습니다.
pt_br: Este é o padrão mais rápido e mais moderno. O suporte em clientes SSH ainda não é universal.
pt_pt: Este é o padrão mais rápido e mais moderno. O suporte em clientes SSH ainda não é universal.
ru: Это самый быстрый и самый современный стандарт. Поддержка в SSH клиентах пока еще не универсальна.
uk: Це найшвидший і найсучасніший стандарт. Може не підтримуватися деякими SSH клієнтами.
zh_hans: 这是最快也是最现代的标准。在 SSH 客户端的支持尚未普及。

# generator_key_ed25519_text
source: Fast and most modern standard
ar: المعايير السريعة والأحدث
de: Schneller und modernster Standard
es: Rápido y el estándar más moderno
fr: Standard rapide et le plus moderne
hu: Gyors és legmodernebb szabvány
it: Standard più veloce e moderno in circolazione
ja: 高速かつ最も現代的でスタンダード
ko: 가장 빠르고 현대적인 표준
pt_br: Padrão rápido e mais moderno
pt_pt: Padrão rápido e mais moderno
ru: Быстрый и самый современный стандарт
uk: Швидкий та найсучасніший стандарт
zh_hans: 快速和最现代的标准

# generator_key_length_item
source: %1$@-bits
ar: %1$@-أجزاء
hu: %1$@ bit
it: %1$@-bit
ja: %1$@ ビット
ko: %1$@- 비트
ru: %1$@-бит
uk: %1$@-біт
zh_hans: %1$@-位

# generator_key_length_title
source: Length
ar: الطول
de: Länge
es: Longitud
fr: Longueur
hu: Hosszúság
it: Lunghezza
ja: 長さ
ko: 길이
pt_br: Comprimento
pt_pt: Nº de caracteres
ru: Длина
uk: Довжина
zh_hans: 长度

# generator_key_rsa_note
source: All SSH clients support this algorithm. A key size of at least 2048 bits is recommended for RSA; 4096 bits is better. It is quite possible the RSA algorithm will become practically breakable in the foreseeable future.
ar: تدعم جميع عملاء SSH هذه الخوارزمية. يوصى بحجم مفتاح لا يقل عن 2048 بت لـ RSA؛ 4096 بت أفضل. من المحتمل جدًا أن تصبح خوارزمية RSA قابلة للكسر عمليًا في المستقبل المنظور.
de: Alle SSH-Clients unterstützen diesen Algorithmus. Eine Schlüsselgröße von mindestens 2048 Bit wird für RSA empfohlen; 4096 Bit ist besser. Es ist durchaus möglich, dass der RSA-Algorithmus in absehbarer Zeit entschlüsselt werden kann.
es: Todos los clientes SSH soportan este algoritmo. Se recomienda un tamaño de clave de al menos 2048 bits para RSA; 4096 bits es mejor. Es bastante posible que el algoritmo RSA se vuelva rompible de forma práctica en un futuro predecible.
fr: Tous les clients SSH prennent en charge cet algorithme. Une taille de clé d'au moins 2048 bits est recommandée pour le protocole RSA mais 4096 bits est mieux. Il est tout à fait possible que l'algorithme RSA devienne pratiquement cassable dans un avenir proche.
hu: Minden SSH kliens támogatja ezt az algoritmust. Legalább 2048 bites kulcsméret ajánlott RSA esetén; a 4096 bit jobb. Teljesen lehetséges, hogy az RSA algoritmus a belátható jövőben gyakorlatilag feltörhetővé válik.
it: Tutti i client SSH supportano questo algoritmo. Per RSA si consiglia una dimensione della chiave di almeno 2048 bit, ma l'ideale sarebbe averne 4096. È assai possibile che l'algoritmo RSA diventi in pratica violabile nel prossimo futuro.
ja: すべての SSH クライアントはこのアルゴリズムをサポートしています。RSA には少なくとも 2048 ビットの鍵のサイズが推奨され、4096 ビットがより優れています。RSA アルゴリズムは近い将来、実際に破られる可能性は十分に考えられます。
ko: 모든 SSH 클라이언트에서 지원하는 알고리즘입니다. RSA 키 크기 추천 값은 최소 2048 비트, 권장 4096 비트입니다. 머지않은 미래에 RSA 알고리즘이 깨질 가능성이 매우 높습니다.
pt_br: Todos os clientes SSH suportam este algoritmo. Um tamanho de chave de pelo menos 2048 bits é recomendado para RSA; 4096 bits é melhor. É perfeitamente possível que o algoritmo RSA se torne praticamente quebrável num futuro previsível.
pt_pt: Todos os clientes SSH suportam este algoritmo. Um tamanho de chave de pelo menos 2048 bits é recomendado para RSA; 4096 bits é melhor. É perfeitamente possível que o algoritmo RSA se torne praticamente quebrável num futuro previsível.
ru: Все клиенты SSH поддерживают этот алгоритм. Для RSA рекомендуется размер ключа не менее 2048 бит, лучше - 4096 бит. Вполне возможно, что в обозримом будущем алгоритм RSA станет уязвимым.
uk: Підтримується всіма SSH клієнтами. Рекомендується використовувати 4096-бітний або 2048-бітний ключ. Алгоритм RSA може перестати бути безпечним в недалекому майбутньому.
zh_hans: 所有 SSH 客户端都支持这种算法。对于 RSA，推荐至少使用 2048 位的密钥大小；4096 位则更好。在可预见的未来，RSA算法变得实际上可以破解是相当可能的。

# generator_key_rsa_text
source: Compatible with all SSH servers
ar: متوافق مع جميع خوادم SSH
de: Kompatibel mit allen SSH-Servern
es: Compatible con todos los servidores SSH
fr: Compatible avec tous les serveurs SSH
hu: Kompatibilis minden SSH szerverrel
it: Compatibile con tutti i server SSH
ja: すべての SSH サーバーと互換性があります
ko: 모든 SSH 서버와 호환 가능
pt_br: Compatível com todos os servidores SSH
pt_pt: Compatível com todos os servidores SSH
ru: Совместим со всеми SSH серверами
uk: Сумісний з усіма SSH серверами
zh_hans: 兼容所有 SSH 服务器

# generator_passphrase_capitalize_title
source: Capitalize
ar: الاستفادة من الحروف الكبيرة
de: Großbuchstaben
es: Mayúsculas
fr: Mettre en majuscules
hu: Nagy kezdőbetű
it: Maiuscole
ja: 英単語の先頭を大文字にする
ko: 첫 글자를 대문자로
pt_br: Capitalizar
pt_pt: Maiúsculas
ru: Прописные
uk: З великої літери
zh_hans: 首字母大写

# generator_passphrase_delimiter_title
source: Delimiter
ar: محدد
de: Trennzeichen
es: Delimitador
fr: Délimiteur
hu: Elválasztójel
it: Separatore
ja: 区切り文字
ko: 구분 기호
pt_br: Delimitador
pt_pt: Limite de caracteres
ru: Разделитель
uk: Роздільник
zh_hans: 分隔符

# generator_passphrase_note
source: Random passphrases provide the best combination of memorability and security.
ar: توفر عبارات المرور العشوائية أفضل مزيج من سهولة التذكر والأمان.
de: Zufällige Passphrasen bieten die beste Kombination aus Gedächtnisfähigkeit und Sicherheit.
es: Las contraseñas aleatorias proporcionan la mejor combinación de memoria y seguridad.
fr: Les phrases de passe aléatoires fournissent la meilleure combinaison de mémorabilité et de sécurité.
hu: A véletlenszerű jelmondatok a legjobb kombinációt nyújtják emlékezhetőség és biztonság szempontjából.
it: Le frasi di accesso casuali forniscono la migliore combinazione di memorabilità e sicurezza.
ja: ランダムなパスフレーズは、記憶性とセキュリティの最良の組み合わせを提供します。
ko: 무작위 비밀 문구는 외우기 쉽고 보안성이 뛰어난 문구 조합을 제공합니다.
pt_br: Senhas de palavras aleatórias fornecem a melhor combinação de memorização e segurança.
pt_pt: As frases-palavra-passe aleatórias oferecem a melhor combinação de facilidade de memorização e segurança.
ru: Случайные парольные фразы обеспечивают наилучшее сочетание запоминаемости и безопасности.
uk: Випадкові парольні фрази забезпечують найкраще поєднання запам'ятовуваності та безпеки.
zh_hans: 随机口令是可记忆性和安全性的最佳组合。

# generator_passphrase_number_title
source: Number
ar: رقم
de: Zahlen
es: Número
fr: Numéro
hu: Szám
it: Numeri
ja: 数字を含める
ko: 숫자 포함
pt_br: Número
pt_pt: Números
ru: Цифры
uk: Число
zh_hans: 数字
